Repository: Vlad-00003/RustWorkshopUploader
Catalog: Localization/strings.*.resx
Languages: ru

# Publish_OpenBrowser
source: Entry upload complete! Open workshop page?
ru: Файл успешно загружен в мастерскую! Открыть ссылку в браузере?

# SteamNotFound
source: Steam is not running!
ru: Steam не запущен!

# Message_Error
source: ERROR
ru: ОШИБКА

# AppError
source: Application error: {0}
ru: Ошибка приложения: {0}

# CustomSkin_DeserializationFailed
source: Failed to Deserialize file {0} as CustomSkin! {1}
ru: Не удалось преобразовать файл {0} в CustomSkin! {1}

# ErrorText
source: Error: {0}
ru: Ошибка: {0}

# Publish_RetreiveFailed
source: Unable to retrieve information from Steam
ru: Не удалось получить информацию из Steam

# Message_Success
source: SUCCESS
ru: УСПЕШНО

# BtnDo_Upload
source: UPLOAD
ru: ЗАГРУЗИТЬ

# BtnDo_Update
source: UPDATE
ru: ОБНОВИТЬ

# BtnDo_Uploading
source: UPLOADING...
ru: ЗАГРУЗКА...

# AdvMessage
source: We are creating and selling private plugins. Do you want to check our website?
ru: Мы занимаемся разработкой приватных плагинов, так же и продаем их. Хотите посетить сайт нашего сообщества?

# AdvMessage_Title
source: Profitable proposition
ru: Выгодное предложение

# Select_UnableToOpen
source: Unable to open selected file
ru: Невозможно открыть выбранный файл

# Select_WrongResolution
source: Image resolutions should be 512x512!
ru: Размер изображения должен быть 512x512!

# Do_NoImage
source: You should chose image file!
ru: Вы должны выбрать изображение!

# Do_NoName
source: You should set item name!
ru: Вы должны указать имя для скина!

# Do_NoDescription
source: You should set the description!
ru: Вы должны указать описание для скина!
